app/Views/backend-template/navbar.php

SELECT *
FROM `menus`
WHERE `menus`.`is_active` = 1
AND `menus`.`deleted_at` IS NULL
---
  // ->join('position_menu', 'position_menu.menu_id = menus.id')
  // ->join('positions', 'positions.id = position_menu.pos_id')
  // ->where('position_menu.pos_id = ' . session('pos_id'))
  // ->where('menus.is_active=1')
  ->findAll();