app/Views/backend-template/navbar.php

// $role = session('role_id');
$menus = new \App\Models\MenusModel();

$query = $menus
  ->join('position_menu', 'position_menu.kd_menu = menus.kd_menu')
  ->join('positions', 'positions.kd_jabatan = position_menu.kd_jabatan')
  ->where('position_menu.kd_jabatan = ' . session('id_jabatan'))
  ->where('menus.menu_active=1')
  ->orderBy('menus.kd_menu')
  ->findAll();
---
SELECT *
FROM `menus`
JOIN `position_menu` ON `position_menu`.`kd_menu` = `menus`.`kd_menu`
JOIN `positions` ON `positions`.`kd_jabatan` = `position_menu`.`kd_jabatan`
WHERE `position_menu`.`kd_jabatan` = 9
AND `menus`.`menu_active` = 1
AND `menus`.`deleted_at` IS NULL
ORDER BY `menus`.`kd_menu`