app/Filters/Auth.php

SELECT *
FROM `menus`
WHERE `url_menu` = 'dashboard'
AND `menus`.`deleted_at` IS NULL
 LIMIT 1
---
    public function before(RequestInterface $request, $arguments = null)
    {
        if (!session()->get('is_logged_in')) {
            return redirect()->to(base_url('auth/'));
        } else {
            $curr_url = current_url(true);
            $uri = new \CodeIgniter\HTTP\URI($curr_url);
            $getUri = $uri->getSegment(1);

            if ($getUri === "profil") {
                redirect()->to(base_url('/profil'));
            } elseif ($getUri === "koleksi") {
                redirect()->to(base_url('/koleksi'));
            } else {
                // $db =  \Config\Database::connect();
                // Ambil data session id_jabatan lalu cek dengan uri segment dan mengambil data menu id
                // $kd_jbt = session('id_jabatan');
                // Ambil menu id
                // $kd_menu = $db->query('
                // SELECT kd_menu FROM menus WHERE url_menu="' . $getUri . '"
                // ');
                // $get_posmenu = $db->query('
                // SELECT * FROM position_menu WHERE kd_jabatan="' . $kd_jbt . '" AND kd_menu="' . $kd_menu . '"
                // ');

                // Ambil kd_menu
                $getMenu = $this->menus_model->where('url_menu', $getUri)->first();