app/Controllers/Archives.php

SELECT `archives`.`kd_arsip` AS `kd_arsip`, `categories`.`nama_kat` AS `kategori`, `archives`.`nomor_arsip` AS `nomor_arsip`, `archives`.`nama_arsip` AS `nama_arsip`, `archives`.`nama_pembuat` AS `pembuat`, `archives`.`tgl_buat` AS `tgl_buat`, `archives`.`nama_file` AS `nama_file`
FROM `archives`
JOIN `categories` ON `categories`.`kd_kategori` = `archives`.`kd_kategori`
WHERE `archives`.`deleted_at` IS NULL
ORDER BY `kd_arsip` DESC
---
  public function index()
  {
    $data = [
      'title'       => 'Master Arsip',
      'navbar'      => 'Master Arsip',
      'card'        => 'List Arsip',
      'archives'  => $this->arc_model
        ->select('archives.kd_arsip AS kd_arsip, categories.nama_kat AS kategori, archives.nomor_arsip AS nomor_arsip, archives.nama_arsip AS nama_arsip, archives.nama_pembuat AS pembuat, archives.tgl_buat AS tgl_buat, archives.nama_file AS nama_file')
        ->join('categories', 'categories.kd_kategori = archives.kd_kategori')
        ->orderBy('kd_arsip', 'DESC')
        ->findAll()

SELECT *
FROM `categories`
WHERE `categories`.`deleted_at` IS NULL
---
  public function add()
  {
    $data = [
      'title'       => 'Tambah Arsip',
      'navbar'      => 'Master Arsip',
      'card'        => 'Form Tambah Arsip',
      'categories'  => $this->cat_model->findAll(),
      'validation'  => \Config\Services::validation()
    ];

SELECT *
FROM `categories`
WHERE `categories`.`deleted_at` IS NULL
---
  public function edit($id)
  {
    $data = [
      'title'       => 'Edit Arsip',
      'navbar'      => 'Master Arsip',
      'card'        => 'Form Edit Arsip',
      'archives'    => $this->arc_model->find($id),
      'categories'  => $this->cat_model->findAll(),
      'validation'  => \Config\Services::validation()
    ];

SELECT `archives`.`kd_kategori` AS `kd_kategori`, `archives`.`kd_arsip` AS `kd_arsip`, `archives`.`nama_arsip` AS `nama_arsip`, `categories`.`nama_kat` AS `kategori`, `archives`.`nomor_arsip` AS `nomor_arsip`, `archives`.`nama_pembuat` AS `pembuat`, `archives`.`tgl_buat` AS `tgl_buat`, `archives`.`ukuran_file` AS `ukuran_file`, `archives`.`created_at` AS `pertama_up`, `archives`.`updated_at` AS `tgl_modif`, `archives`.`nama_file` AS `nama_file`, `archives`.`mime` AS `mime`, `archives`.`id_contributor` AS `id_contributor`, `archives`.`id_uploader` AS `id_uploader`
FROM `archives`
JOIN `categories` ON `categories`.`kd_kategori` = `archives`.`kd_kategori`
WHERE `archives`.`nama_file` = '1663055419_c71079d87661487137e1.pdf'
AND `archives`.`deleted_at` IS NULL
 LIMIT 1
SELECT `archives_access`.`kd_arsip` AS `id_arsip`, `users`.`nama_user` AS `nama_user`, `positions`.`singkatan_jbt` AS `singkatan_jbt`, `archives_access`.`tgl_akses` AS `tgl_akses`, `archives_access`.`keterangan` AS `keterangan`
FROM `archives_access`
LEFT JOIN `users` ON `users`.`kd_user` = `archives_access`.`kd_user`
LEFT JOIN `positions` ON `positions`.`kd_jabatan` = `users`.`kd_jabatan`
WHERE `kd_arsip` = '14'
SELECT `archives_access`.`kd_arsip` AS `id_arsip`, `users`.`nama_user` AS `nama_user`, `positions`.`singkatan_jbt` AS `singkatan_jbt`, `archives_access`.`tgl_akses` AS `tgl_akses`, `archives_access`.`keterangan` AS `keterangan`
FROM `archives_access`
LEFT JOIN `users` ON `users`.`kd_user` = `archives_access`.`kd_user`
LEFT JOIN `positions` ON `positions`.`kd_jabatan` = `users`.`kd_jabatan`
WHERE `kd_arsip` = '13'
---
  public function detail($slug)
  {
    $getArc = $this->arc_model
      ->select('archives.kd_kategori AS kd_kategori, archives.kd_arsip AS kd_arsip, archives.nama_arsip AS nama_arsip, categories.nama_kat AS kategori, archives.nomor_arsip AS nomor_arsip, archives.nama_pembuat AS pembuat, archives.tgl_buat AS tgl_buat, archives.ukuran_file AS ukuran_file, archives.created_at AS pertama_up, archives.updated_at AS tgl_modif, archives.nama_file AS nama_file, archives.mime AS mime, archives.id_contributor AS id_contributor, archives.id_uploader AS id_uploader')
      ->join('categories', 'categories.kd_kategori = archives.kd_kategori')
      ->where('archives.nama_file = ', $slug)
      ->first();

    $nama_uploader = $this->user_model->find($getArc['id_uploader']);
    $nama_kontributor = $this->user_model->find($getArc['id_contributor']);

    $data = [
      'title'        => 'Detail Arsip',
      'navbar'       => 'Master Arsip',
      'accessing'    => 'List Akun Pengakses Arsip',
      'card'         => 'Detail Arsip',
      'nama_uploader' => $nama_uploader['nama_user'],
      'nama_kontributor' => $nama_kontributor['nama_user'],
      'archives'     => $getArc,
      'list_access'  => $this->acc_model
        ->select('archives_access.kd_arsip AS id_arsip, users.nama_user AS nama_user, positions.singkatan_jbt AS singkatan_jbt, archives_access.tgl_akses AS tgl_akses, archives_access.keterangan AS keterangan')
        ->join('users', 'users.kd_user = archives_access.kd_user', 'left')
        ->join('positions', 'positions.kd_jabatan = users.kd_jabatan', 'left')
        ->where('kd_arsip', $getArc['kd_arsip'])->findAll(),
    ];