app/Controllers/Archives.php

  public function index()
  {
    $data = [
      'title'       => 'Master Arsip',
      'navbar'      => 'Master Arsip',
      'card'        => 'List Arsip',
      'archives'  => $this->arc_model
        ->join('categories', 'categories.kd_kategori = archives.kd_kategori')
        ->orderBy('kd_arsip', 'DESC')
        ->findAll()
    ];
---
SELECT *
FROM `archives`
JOIN `categories` ON `categories`.`kd_kategori` = `archives`.`kd_kategori`
WHERE `archives`.`deleted_at` IS NULL
ORDER BY `kd_arsip` DESC