app/Controllers/Auth.php

    public function login()
    {
        // Validasi form
        if (!$this->validate([
            'email' => [
                'rules' => 'required|valid_email',
                'errors' => [
                    'required' => 'Mohon isi email terlebih dahulu.',
                    'valid_email' => 'Mohon isi kolom email dengan benar.',
                ]
            ],
            'password' => [
                'rules' => 'required',
                'errors' => [
                    'required' => 'Mohon isi password terlebih dahulu.'
                ]
            ]
        ])) {
            return redirect()->to(base_url() . '/auth')->withInput();
        }

        $inputEmail = htmlspecialchars($this->request->getVar('email'));
        $inputPass = htmlspecialchars($this->request->getVar('password'));
        $getAccount = $this->user_model
            ->join('user_position', 'user_position.user_id = users.id')
            ->where(['email' => $inputEmail])
            ->first();
---
SELECT *
FROM `users`
JOIN `user_position` ON `user_position`.`user_id` = `users`.`id`
WHERE `email` = 'royadisurya@mail.com'
AND `users`.`deleted_at` IS NULL
 LIMIT 1