app/Controllers/Auth.php

SELECT `users`.`kd_user` AS `kd_user`, `users`.`kd_jabatan` AS `id_jabatan`, `users`.`nama_user` AS `nama_user`, `users`.`email` AS `email`, `users`.`password_hash` AS `password_hash`, `users`.`foto` AS `foto`, `users`.`user_active` AS `user_active`, `users`.`is_login` AS `is_login`
FROM `users`
JOIN `positions` ON `positions`.`kd_jabatan` = `users`.`kd_jabatan`
WHERE `email` = 'user_ketua@mail.com'
AND `user_active` = 1
AND `users`.`deleted_at` IS NULL
 LIMIT 1
---
    public function login()
    {
        // Validasi form
        if (!$this->validate([
            'email' => [
                'rules' => 'required|valid_email',
                'errors' => [
                    'required' => 'Mohon isi email terlebih dahulu.',
                    'valid_email' => 'Mohon isi kolom email dengan benar.',
                ]
            ],
            'password' => [
                'rules' => 'required',
                'errors' => [
                    'required' => 'Mohon isi password terlebih dahulu.'
                ]
            ]
        ])) {
            return redirect()->to(base_url() . '/auth')->withInput();
        }

        $inputEmail = htmlspecialchars($this->request->getVar('email'));
        $inputPass = htmlspecialchars($this->request->getVar('password'));
        $getAccount = $this->user_model
            ->select('users.kd_user AS kd_user, users.kd_jabatan AS id_jabatan, users.nama_user AS nama_user, users.email AS email,
            users.password_hash AS password_hash, users.foto AS foto, users.user_active AS user_active, users.is_login AS is_login')
            ->join('positions', 'positions.kd_jabatan = users.kd_jabatan')
            ->where(['email' => $inputEmail, 'user_active' => 1])
            ->first();

UPDATE `users` SET `is_login` = 1, `updated_at` = '2022-09-13 18:30:22'
WHERE `users`.`kd_user` IN ('7')
---
                        'foto' => $getAccount['foto'],
                        'is_logged_in' => true,
                    ];
                    $this->user_model->save([
                        'kd_user' => $getAccount['kd_user'],
                        'is_login' => 1,
                    ]);

UPDATE `users` SET `is_login` = 1, `updated_at` = '2022-09-13 05:02:09'
WHERE `users`.`kd_user` IN ('8')
---
    public function logout()
    {
        // Ganti is_login menjadi 0
        $this->user_model->save([
            'kd_user' => session('kd_user'),
            'is_login' => 0
        ]);