app/Controllers/Categories.php

SELECT *
FROM `categories`
WHERE `categories`.`deleted_at` IS NULL
---
  public function index()
  {
    $data = [
      'title'       => 'Master Kategori',
      'navbar'      => 'Master Kategori',
      'card'        => 'List Kategori',
      'instance'    => $this->arc_model,
      'categories'  => $this->cat_model->findAll()

SELECT *
FROM `categories`
WHERE `categories`.`deleted_at` IS NOT NULL
---
  public function show_all_deleted()
  {
    $data = [
      'title'        => 'Kategori Terhapus',
      'navbar'       => 'Master Kategori',
      'card'         => 'List Kategori Terhapus',
      'categories'   => $this->cat_model->onlyDeleted()->findAll(),