app/Controllers/Collection.php

SELECT *
FROM `archives`
JOIN `categories` ON `categories`.`kd_kategori` = `archives`.`kd_kategori`
WHERE `archives`.`deleted_at` IS NULL
ORDER BY `categories`.`kd_kategori` ASC, `archives`.`kd_arsip` DESC
---
  public function index()
  {
    $data = [
      'title'       => 'Koleksi Arsip',
      'navbar'      => 'Koleksi Arsip',
      'card'        => 'List Koleksi Arsip',
      'archives'  => $this->arc_model
        ->join('categories', 'categories.kd_kategori = archives.kd_kategori')
        ->orderBy('categories.kd_kategori ASC, archives.kd_arsip DESC')
        ->findAll()

SELECT `archives`.`kd_kategori` AS `kd_kategori`, `archives`.`kd_arsip` AS `kd_arsip`, `archives`.`nama_arsip` AS `nama_arsip`, `categories`.`nama_kat` AS `kategori`, `archives`.`nomor_arsip` AS `nomor_arsip`, `archives`.`nama_pembuat` AS `pembuat`, `archives`.`tgl_buat` AS `tgl_buat`, `archives`.`ukuran_file` AS `ukuran_file`, `archives`.`created_at` AS `pertama_up`, `archives`.`updated_at` AS `tgl_modif`, `archives`.`nama_file` AS `nama_file`, `archives`.`mime` AS `mime`
FROM `archives`
JOIN `categories` ON `categories`.`kd_kategori` = `archives`.`kd_kategori`
WHERE `archives`.`nama_file` = '1663055419_c71079d87661487137e1.pdf'
AND `archives`.`deleted_at` IS NULL
 LIMIT 1
---
  public function detail($nama_file)
  {
    // $getArc = $this->arc_model
    //   ->join('categories', 'categories.kd_kategori = archives.kd_kategori')
    //   ->where('nama_file', $nama_file)->first();

    $getArc = $this->arc_model
      ->select('archives.kd_kategori AS kd_kategori, archives.kd_arsip AS kd_arsip, archives.nama_arsip AS nama_arsip, categories.nama_kat AS kategori, archives.nomor_arsip AS nomor_arsip, archives.nama_pembuat AS pembuat, archives.tgl_buat AS tgl_buat, archives.ukuran_file AS ukuran_file, archives.created_at AS pertama_up, archives.updated_at AS tgl_modif, archives.nama_file AS nama_file, archives.mime AS mime')
      ->join('categories', 'categories.kd_kategori = archives.kd_kategori')
      ->where('archives.nama_file = ', $nama_file)
      ->first();