app/Controllers/Dashboard.php

SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `deleted_at` IS NULL
AND `users`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `user_active` = 0
AND `users`.`deleted_at` IS NULL
SELECT `archives`.`kd_kategori` AS `kd_kategori`, `archives`.`kd_arsip` AS `kd_arsip`, `archives`.`nama_arsip` AS `nama_arsip`, `archives`.`nomor_arsip` AS `nomor_arsip`, `archives`.`nama_pembuat` AS `pembuat`, `archives`.`updated_at` AS `tgl_update`
FROM `archives`
JOIN `categories` ON `categories`.`kd_kategori` = `archives`.`kd_kategori`
WHERE `archives`.`deleted_at` IS NULL
ORDER BY `archives`.`kd_arsip` DESC
SELECT `users`.`nama_user` AS `nama_user`, `users`.`kd_jabatan` AS `id_jbt`, `positions`.`nama_jbt` AS `jabatan`, `users`.`log_date` AS `log_date`
FROM `users`
JOIN `positions` ON `positions`.`kd_jabatan` = `users`.`kd_jabatan`
WHERE `log_date` IS NOT NULL
AND `users`.`deleted_at` IS NULL
---
  public function index()
  {
    // Ambil total surat
    $totalMail = $this->mail_model->where(['deleted_at' => NULL])->countAllResults();
    // Ambil total arsip
    $totalArc = $this->arc_model->where(['deleted_at' => NULL])->countAllResults();
    // Ambil total User
    $totalUser = $this->user_model->where(['deleted_at' => NULL])->countAllResults();
    // Ambil total user nonaktif
    $totalNonActive = $this->user_model->where(['user_active' => 0])->countAllResults();

    // Ambil arsip
    $getLatestArc = $this->arc_model
      ->select('archives.kd_kategori AS kd_kategori, archives.kd_arsip AS kd_arsip, archives.nama_arsip AS nama_arsip, archives.nomor_arsip AS nomor_arsip, archives.nama_pembuat AS pembuat, archives.updated_at AS tgl_update')
      ->join('categories', 'categories.kd_kategori = archives.kd_kategori')
      ->orderBy('archives.kd_arsip', 'DESC')
      ->limit(10, 20)
      ->findAll();

    // Ambil jumlah user yang sedang login
    $getLoggedInUser = $this->user_model
      ->select('users.nama_user AS nama_user, users.kd_jabatan AS id_jbt, positions.nama_jbt AS jabatan, users.log_date AS log_date, users.is_login AS is_login')
      ->join('positions', 'positions.kd_jabatan = users.kd_jabatan')
      ->where('log_date !=', NULL)
      ->findAll();