app/Controllers/OutgoingMail.php

SELECT `outgoing_mail`.`kd_suratkeluar` AS `kd_suratkeluar`, `mail_type`.`nama_jenis` AS `nama_jenis`, `outgoing_mail`.`nomor_surat` AS `nomor_surat`, `outgoing_mail`.`kd_user` AS `id_user`, `users`.`nama_user` AS `nama_user`, `outgoing_mail`.`created_at` AS `waktu_buat`
FROM `outgoing_mail`
LEFT JOIN `mail_type` ON `mail_type`.`kd_jenissurat` = `outgoing_mail`.`kd_jenissurat`
LEFT JOIN `users` ON `users`.`kd_user` = `outgoing_mail`.`kd_user`
WHERE `outgoing_mail`.`deleted_at` IS NULL
---
  public function index()
  {
    $data = [
      'title'   => 'Master Surat Keluar',
      'navbar'  => 'Surat Keluar',
      'card'    => 'List Surat Keluar',
      'mail'    => $this->outmail
        ->select('outgoing_mail.kd_suratkeluar AS kd_suratkeluar, mail_type.nama_jenis AS nama_jenis, outgoing_mail.nomor_surat AS nomor_surat, outgoing_mail.kd_user AS id_user, users.nama_user AS nama_user, outgoing_mail.created_at AS waktu_buat')
        ->join('mail_type', 'mail_type.kd_jenissurat = outgoing_mail.kd_jenissurat', 'LEFT')
        ->join('users', 'users.kd_user = outgoing_mail.kd_user', 'LEFT')
        ->findAll()

SELECT *
FROM `mail_type`
WHERE `mail_type`.`deleted_at` IS NULL
---
  public function add()
  {
    $data = [
      'title'       => 'Buat Surat Keluar',
      'navbar'      => 'Surat Keluar',
      'card'        => 'Form Buat Surat Keluar',
      'mailtype'    => $this->mailtype->findAll(),

SELECT `kd_jenissurat`
FROM `mail_type`
WHERE `mail_type`.`deleted_at` IS NULL
SELECT *
FROM `mail_type`
WHERE `mail_type`.`deleted_at` IS NULL
AND `mail_type`.`kd_jenissurat` = '4'
---
  public function insert()
  {
    $postJenisSurat = $this->request->getVar('kd_jenissurat');
    $postNoSurat = $this->request->getVar('nomor_surat');
    $postPerihal = $this->request->getVar('perihal');
    $postLampiran = $this->request->getVar('lampiran');
    $postTglBuat = $this->request->getVar('tgl_buat');
    $postTglTtd = $this->request->getVar('tgl_ttd');

    $getImpJS = implode(",", $this->mailtype->findColumn('kd_jenissurat'));
    $validate = [
      'kd_jenissurat' => [
        'rules' => 'in_list[' . $getImpJS . ']',
        'errors' => [
          'required' => 'Mohon isi kolom judul surat.',
        ]
      ],
      'nomor_surat' => [
        'rules' => 'required',
        'errors' => [
          'required' => 'Mohon isi kolom nomor surat.',
        ]
      ]
    ];

    if (!$this->validate($validate)) {
      return redirect()->to(base_url('surat-keluar/buat'))->withInput();
    } else {

      $getMType = $this->mailtype->find($postJenisSurat);