app/Controllers/Positions.php

  public function edit($id)
  {
    $data = [
      'title'       => 'Edit Posisi',
      'navbar'      => 'Master Posisi',
      'card'        => 'Form Edit Posisi',
      'position'    => $this->positions_model->find($id),
---
SELECT *
FROM `positions`
WHERE `positions`.`deleted_at` IS NULL
AND `positions`.`id` = '22'

  public function show_all_deleted()
  {
    $data = [
      'title' => 'Posisi Terhapus',
      'navbar'      => 'Master Posisi',
      'card'  => 'List Posisi Terhapus',
      'positions' => $this->positions_model->onlyDeleted()->findAll(),
---
SELECT *
FROM `positions`
WHERE `positions`.`deleted_at` IS NOT NULL