app/Controllers/Profile.php

SELECT *
FROM `users`
LEFT JOIN `positions` ON `positions`.`kd_jabatan` = `users`.`kd_jabatan`
WHERE `users`.`deleted_at` IS NULL
AND `users`.`kd_user` = '8'
---
  public function index()
  {
    $getuser = $this->user_model
      ->join('positions', 'positions.kd_jabatan = users.kd_jabatan', 'LEFT')
      ->find(session('kd_user'));