app/Controllers/Users.php

SELECT `users`.`kd_user` AS `kd_user`, `users`.`kd_jabatan` AS `id_jbt`, `positions`.`singkatan_jbt` AS `jabatan`, `users`.`nama_user` AS `nama_user`, `users`.`created_at` AS `tgl_terdaftar`, `users`.`user_active` AS `user_active`, `users`.`is_login` AS `is_login`
FROM `users`
LEFT JOIN `positions` ON `positions`.`kd_jabatan` = `users`.`kd_jabatan`
WHERE `users`.`deleted_at` IS NULL
---
  public function index()
  {
    $data = [
      'title'         => 'Master User',
      'navbar'        => 'Master User',
      'card'          => 'List User',
      'users'         => $this->users_model
        ->select('users.kd_user AS kd_user, users.kd_jabatan AS id_jbt, positions.singkatan_jbt AS jabatan, users.nama_user AS nama_user, users.created_at AS tgl_terdaftar, users.user_active AS user_active, users.is_login AS is_login')
        ->join('positions', 'positions.kd_jabatan = users.kd_jabatan', 'left')
        ->findAll(),